src/mp_toir/Documents/мп_ЗаданиеНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_ЗаданиеНаРемонт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаРемонт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаказНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнениеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателяИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмеренияПроверкиВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоотчетОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщиеВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехРешение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МатериалыКСписанию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоматическиДобавленнаяСтрока</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаХарактеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаСерия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыКОприходованию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фотографии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УстановленныеТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Enums/мп_ИсточникиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>мп_ИсточникиДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МечелТОиР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/mp_toir/Documents/мп_ЗаданиеНаРемонт/Forms/ФормаСтрокиСписания/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИменаЭлементов = "Номенклатура, Характеристика, Серия, Склад, План, Факт, ИдентификаторСтроки"
		+ ", ЗаменаНоменклатура, ЗаменаХарактеристика, ЗаменаСерия, ОбъектЭксплуатации, ВыбранныйУзел"
		+ ", СтатусУказанияСерий, Источник, СтатусОбмена, ТолькоПросмотр, НомерСтроки";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, ИменаЭлементов);

	ЭтотОбъект.МатериалыКОприходованию.Загрузить(Параметры.МатериалыКОприходованию.Выгрузить());
	ЭтотОбъект.МатериалыКСписанию.Загрузить(Параметры.МатериалыКСписанию.Выгрузить());

	ЗаданиеНаРемонтВызовСервераЛокализация.ЗаполнитьСписокИзменяемыхВидовНоменклатуры(ЭтотОбъект);

	ДоступностьРеквизитов();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	ЗначенияСтроки = Новый Структура;
	ЗначенияСтроки.Вставить("Номенклатура", ЭтотОбъект.Номенклатура);
	ЗначенияСтроки.Вставить("Характеристика", ЭтотОбъект.Характеристика);
	ЗначенияСтроки.Вставить("Серия", ЭтотОбъект.Серия);
	ЗначенияСтроки.Вставить("Склад", ЭтотОбъект.Склад);
	ЗначенияСтроки.Вставить("План", ЭтотОбъект.План);
	ЗначенияСтроки.Вставить("Факт", ЭтотОбъект.Факт);
	ЗначенияСтроки.Вставить("НомерСтроки", ЭтотОбъект.НомерСтроки);
	ЗначенияСтроки.Вставить("СохранитьИзменения", ЭтотОбъект.СохранитьИзменения);
	ЗначенияСтроки.Вставить("ИдентификаторСтроки", ЭтотОбъект.ИдентификаторСтроки);
	ОповеститьОВыборе(ЗначенияСтроки);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.мп_ЗаданиеНаРемонт.Форма.ФормаУстановленныеТМЦ" Тогда
		Если ИсточникВыбора.СохранитьИзменения Тогда
			ЭтотОбъект.ЗаменаНоменклатура = ИсточникВыбора.ВыбраннаяНоменклатура;
			ЭтотОбъект.ЗаменаХарактеристика = ИсточникВыбора.ВыбраннаяХарактеристика;
			ЭтотОбъект.ЗаменаСерия = ИсточникВыбора.ВыбраннаяСерия;
			ДоступностьРеквизитов();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ПодборХарактеристики(ЭтотОбъект.Номенклатура, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПодборХарактеристики(Знач Номенклатура, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		МассивЭлементов = Новый Массив;
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(Номенклатура);
		Если Не Характеристики = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Характеристики);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)

	ДоступностьРеквизитов();

КонецПроцедуры

&НаКлиенте
Процедура СерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ПодборСерии(ЭтотОбъект.Номенклатура, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПодборСерии(Знач Номенклатура, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		МассивЭлементов = Новый Массив;
		Серии = ОбщегоНазначенияВызовСервера.СерииПоНоменклатуре(Номенклатура);
		Если Не Серии = Неопределено Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Серии);
			МассивЭлементов.Добавить(НовыйПараметр);
		Иначе
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);
	Иначе 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Склады = ОбщегоНазначенияВызовСервера.СкладыПоКонстанте();
	Если Склады = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", Склады);
	МассивЭлементов.Добавить(НовыйПараметр);
	НовыйПараметр = Новый ПараметрВыбора("Номенклатура", ЭтотОбъект.Номенклатура);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);

КонецПроцедуры

&НаКлиенте
Процедура ПланПриИзменении(Элемент)
	Если ЭтотОбъект.Источник = ПредопределенноеЗначение("Перечисление.мп_ИсточникиДокументов.МечелТОиР") Тогда
		ЭтотОбъект.Факт = ЭтотОбъект.План;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	НоменклатураДляЗамены = ЗаменяемаяНоменклатура();

	Если НоменклатураДляЗамены = Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	МассивЭлементов = Новый Массив;
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", НоменклатураДляЗамены);
	МассивЭлементов.Добавить(НовыйПараметр);
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивЭлементов);

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаНоменклатураПриИзменении(Элемент)
	ДоступностьРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ПодборХарактеристики(ЭтотОбъект.ЗаменаНоменклатура, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ЗаменаСерияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ПодборСерии(ЭтотОбъект.ЗаменаНоменклатура, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	Если ПроверкаЗаполнения() Тогда
		ЭтотОбъект.СохранитьИзменения = Истина;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтотОбъект.СохранитьИзменения = Ложь;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура УстановленныеТМЦ(Команда)
	Данные = Новый Структура;
	Данные.Вставить("ОбъектЭксплуатации", ЭтотОбъект.ОбъектЭксплуатации);
	Данные.Вставить("ВыбранныйУзел", ЭтотОбъект.ВыбранныйУзел);
	Данные.Вставить("МатериалыКОприходованию", ЭтотОбъект.МатериалыКОприходованию);
	Данные.Вставить("МатериалыКСписанию", ЭтотОбъект.МатериалыКСписанию);
	ПустойСписок = Новый СписокЗначений;
	Данные.Вставить("ЗаменяемыеВидыНоменклатуры", ПустойСписок);

	ОткрытьФорму("Документ.мп_ЗаданиеНаРемонт.Форма.ФормаУстановленныеТМЦ",
		Данные, ЭтотОбъект, ЭтотОбъект.УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДоступностьРеквизитов()
	
	Если ЭтотОбъект.ТолькоПросмотр Тогда
		
		РазрешеноИзменять =Новый Массив;
		
		ДоступностьЗамены = ЗаданиеНаРемонтВызовСервераЛокализация.ЭтоИзменяемаяНоменклатура(
			ЭтотОбъект.Номенклатура, ЭтотОбъект.ЗаменяемыеВидыНоменклатуры, ЭтотОбъект.ЗаменаНоменклатура);

	//	Если Не ДоступностьЗамены Тогда
			РазрешеноИзменять.Добавить("ЗаменяемаяНоменклатура");
	//	КонецЕсли;

		ЗапрещеноИзменять = Новый Массив;
		ЗапрещеноИзменять = 
			ОбщегоНазначения.ЗапрещаемыеЭлементы(Элементы, РазрешеноИзменять, ЗапрещеноИзменять);
			
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, РазрешеноИзменять, "Доступность", Истина);

		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
			Элементы, ЗапрещеноИзменять, "Доступность", Ложь);
			
		Возврат;
		
	КонецЕсли;
	ДоступностьЗаменыНоменклатуры();
	ДоступностьХарактеристики();
	УстановитьДоступностьСерий();

КонецПроцедуры

&НаСервере
Процедура ДоступностьЗаменыНоменклатуры()

	ДоступностьЗамены = ЗаданиеНаРемонтВызовСервераЛокализация.ЭтоИзменяемаяНоменклатура(
		ЭтотОбъект.Номенклатура, ЭтотОбъект.ЗаменяемыеВидыНоменклатуры, ЭтотОбъект.ЗаменаНоменклатура);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЗаменаНоменклатура", "Доступность", ДоступностьЗамены, Истина);

//	ДоступностьУстановленныеТМЦ = ЗначениеЗаполнено(ЭтотОбъект.Номенклатура);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "УстановленныеТМЦ", "Доступность", ДоступностьЗамены, Истина);

	Если ДоступностьЗамены Тогда
		Элементы.ЗаменяемаяНоменклатура.Показать();;
	Иначе
		Элементы.ЗаменяемаяНоменклатура.Скрыть();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьСерий()

	ДоступностьСерий = ДоступностьСерий();
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Серия", "Доступность", ДоступностьСерий.Серия);

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЗаменаСерия", "Доступность", ДоступностьСерий.ЗаменаСерия);

КонецПроцедуры

&НаСервере
Функция ДоступностьСерий()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВыбраннаяНоменклатура", ЭтотОбъект.Номенклатура);
	Запрос.УстановитьПараметр("ЗаменаНоменклатура", ЭтотОбъект.ЗаменаНоменклатура);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК ИспользоватьСерии
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО (Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка)
	|			И (ВидыНоменклатуры.ИспользоватьСерии)
	|			И (Номенклатура.Ссылка = &ВыбраннаяНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИСТИНА КАК ИспользоватьСерии
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|		ПО (Номенклатура.ВидНоменклатуры = ВидыНоменклатуры.Ссылка
	|				И ВидыНоменклатуры.ИспользоватьСерии
	|				И Номенклатура.Ссылка = &ЗаменаНоменклатура)";

	ПакетРезультатов = Запрос.ВыполнитьПакет();
	ИндексПоследнегоПакета = ПакетРезультатов.ВГраница();
	
	Результат1 = ПакетРезультатов[ИндексПоследнегоПакета - 1];
	ДоступностьСерии = Не Результат1.Пустой();
	
		
	Результат2 = ПакетРезультатов[ИндексПоследнегоПакета];
	ДоступностьЗаменаСерии = Не Результат2.Пустой();
	
	ДоступностьСерий = Новый Структура;
	ДоступностьСерий.Вставить("Серия", ДоступностьСерии);
	ДоступностьСерий.Вставить("ЗаменаСерия", ДоступностьЗаменаСерии);
	
	Возврат ДоступностьСерий;

КонецФункции

&НаСервере
Процедура ДоступностьХарактеристики()

	ДоступностьВыбора = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		ДоступностьВыбора = ?(Характеристики = Неопределено, Ложь, Истина);
	КонецЕсли;

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Характеристика", "Доступность", ДоступностьВыбора);
		
	ДоступностьВыбора = Ложь;
	Если ЗначениеЗаполнено(ЭтотОбъект.ЗаменаНоменклатура) Тогда
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.ЗаменаНоменклатура);
		ДоступностьВыбора = ?(Характеристики = Неопределено, Ложь, Истина);
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЗаменаХарактеристика", "Доступность", ДоступностьВыбора);
		
КонецПроцедуры

&НаСервере
Функция ЗаменяемаяНоменклатура()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры В(&ЗаменяемыеВидыНоменклатуры)
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.Ссылка = &ИсключитьНоменклатуру";
	
	Запрос.УстановитьПараметр(
		"ЗаменяемыеВидыНоменклатуры", ЭтотОбъект.ЗаменяемыеВидыНоменклатуры);
	Запрос.УстановитьПараметр(
		"ИсключитьНоменклатуру", ЭтотОбъект.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПроверкаЗаполнения()

	Ошибки = Неопределено;
	ДоступностьВыбораХарактеристики = Ложь;
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Номенклатура) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Номенклатура", "Укажите номенклатуру");
	Иначе
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		ДоступностьВыбораХарактеристики = ?(Характеристики = Неопределено, Ложь, Истина);
	КонецЕсли;
	
	Если ДоступностьВыбораХарактеристики И Не ЗначениеЗаполнено(ЭтотОбъект.Характеристика) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Характеристика", "Укажите характеристику");
	КонецЕсли;
	
	ДоступностьВыбораХарактеристики = Ложь;
	ДоступностьЗамены = ЗаданиеНаРемонтВызовСервераЛокализация.ЭтоИзменяемаяНоменклатура(
		ЭтотОбъект.Номенклатура, ЭтотОбъект.ЗаменяемыеВидыНоменклатуры, ЭтотОбъект.ЗаменаНоменклатура);
	Если ДоступностьЗамены И Не ЗначениеЗаполнено(ЭтотОбъект.ЗаменаНоменклатура) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ЗаменаНоменклатура", "Укажите заменяемую номенклатуру");
	ИначеЕсли ДоступностьЗамены И ЗначениеЗаполнено(ЭтотОбъект.ЗаменаНоменклатура) Тогда
		Характеристики = ОбщегоНазначенияВызовСервера.ХарактеристикиПоНоменклатуре(ЭтотОбъект.Номенклатура);
		ДоступностьВыбораХарактеристики = ?(Характеристики = Неопределено, Ложь, Истина);
	КонецЕсли;

	Если ДоступностьВыбораХарактеристики И Не ЗначениеЗаполнено(ЭтотОбъект.ЗаменаХарактеристика) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ЗаменаХарактеристика", "Укажите заменяемую характеристику");
	КонецЕсли;
	
	ДоступностьСерий = ДоступностьСерий();
	Если ДоступностьСерий.Серия И Не ЗначениеЗаполнено(ЭтотОбъект.Серия) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Серия", "Укажите серию");
	КонецЕсли;
	
	Если ДоступностьСерий.ЗаменаСерия И Не ЗначениеЗаполнено(ЭтотОбъект.ЗаменаСерия) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ЗаменаСерия", "Укажите заменяемую серию");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Склад) Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Склад", "Укажите склад");
	КонецЕсли;

	Если ЭтотОбъект.Факт = 0 Тогда
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Факт", "Укажите факт");
	КонецЕсли;
	
	Если Не Ошибки = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;

КонецФункции

#КонецОбласти
